# Objective - Converting Data Types in Pandas
# Data Processing
# Data Transformation

## Spl Thanks

- https://pbpython.com/pandas_dtypes.html

## Load Python Modules , Then Read th csv file

In [2]:
import numpy as np
import pandas as pd

df = pd.read_csv("sales_data_types.csv")

In [3]:
## data types 
df.dtypes

Customer Number    float64
Customer Name       object
2016                object
2017                object
Percent Growth      object
Jan Units           object
Month                int64
Day                  int64
Year                 int64
Active              object
dtype: object

In [4]:
df

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Month,Day,Year,Active
0,10002.0,Quest Industries,"$125,000.00",$162500.00,30.00%,500,1,10,2015,Y
1,552278.0,Smith Plumbing,"$920,000.00","$101,2000.00",10.00%,700,6,15,2014,Y
2,23477.0,ACME Industrial,"$50,000.00",$62500.00,25.00%,125,3,29,2016,Y
3,24900.0,Brekke LTD,"$350,000.00",$490000.00,4.00%,75,10,27,2015,Y
4,651029.0,Harbor Co,"$15,000.00",$12750.00,-15.00%,Closed,2,2,2014,N

# Q 1
- the Customer Number in the dataset defined as a float instead of an int64, and 
- what steps can be taken to ensure its proper representation as an int64?"

In [16]:
df["Customer Number"] = df["Customer Number"].astype('int')

In [17]:
df.dtypes

Customer Number     int32
Customer Name      object
2016               object
2017               object
Percent Growth     object
Jan Units          object
Month               int64
Day                 int64
Year                int64
Active             object
dtype: object

In [18]:
df

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Month,Day,Year,Active
0,10002,Quest Industries,"$125,000.00",$162500.00,30.00%,500,1,10,2015,Y
1,552278,Smith Plumbing,"$920,000.00","$101,2000.00",10.00%,700,6,15,2014,Y
2,23477,ACME Industrial,"$50,000.00",$62500.00,25.00%,125,3,29,2016,Y
3,24900,Brekke LTD,"$350,000.00",$490000.00,4.00%,75,10,27,2015,Y
4,651029,Harbor Co,"$15,000.00",$12750.00,-15.00%,Closed,2,2,2014,N

# Q 2
- How do you plan to convert the 2016 and 2017 columns from object type 
- to numerical values such as float64 or int64 in the dataset?

In [23]:
df["2016"]=df["2016"].apply(lambda x: x.replace('$', '').replace(',', '')).astype('float')

In [24]:
df

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Month,Day,Year,Active
0,10002,Quest Industries,125000.0,$162500.00,30.00%,500,1,10,2015,Y
1,552278,Smith Plumbing,920000.0,"$101,2000.00",10.00%,700,6,15,2014,Y
2,23477,ACME Industrial,50000.0,$62500.00,25.00%,125,3,29,2016,Y
3,24900,Brekke LTD,350000.0,$490000.00,4.00%,75,10,27,2015,Y
4,651029,Harbor Co,15000.0,$12750.00,-15.00%,Closed,2,2,2014,N

In [25]:
df["2017"]=df["2017"].apply(lambda x: x.replace('$', '').replace(',', '')).astype('float')

In [26]:
df

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Month,Day,Year,Active
0,10002,Quest Industries,125000.0,162500.0,30.00%,500,1,10,2015,Y
1,552278,Smith Plumbing,920000.0,1012000.0,10.00%,700,6,15,2014,Y
2,23477,ACME Industrial,50000.0,62500.0,25.00%,125,3,29,2016,Y
3,24900,Brekke LTD,350000.0,490000.0,4.00%,75,10,27,2015,Y
4,651029,Harbor Co,15000.0,12750.0,-15.00%,Closed,2,2,2014,N

# Q 3
- Percent Growth and Jan Units are also stored as objects not numerical values

In [27]:
df.dtypes

Customer Number      int32
Customer Name       object
2016               float64
2017               float64
Percent Growth      object
Jan Units           object
Month                int64
Day                  int64
Year                 int64
Active              object
dtype: object

In [30]:
df['Jan Units']= pd.to_numeric(df['Jan Units'], errors='coerce')

In [31]:
df

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Month,Day,Year,Active
0,10002,Quest Industries,125000.0,162500.0,30.00%,500.0,1,10,2015,Y
1,552278,Smith Plumbing,920000.0,1012000.0,10.00%,700.0,6,15,2014,Y
2,23477,ACME Industrial,50000.0,62500.0,25.00%,125.0,3,29,2016,Y
3,24900,Brekke LTD,350000.0,490000.0,4.00%,75.0,10,27,2015,Y
4,651029,Harbor Co,15000.0,12750.0,-15.00%,NaN,2,2,2014,N

In [33]:
df['Percent Growth'] = df['Percent Growth'].apply(lambda x: x.replace('%', '')).astype('float')

In [34]:
df

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Month,Day,Year,Active
0,10002,Quest Industries,125000.0,162500.0,30.0,500.0,1,10,2015,Y
1,552278,Smith Plumbing,920000.0,1012000.0,10.0,700.0,6,15,2014,Y
2,23477,ACME Industrial,50000.0,62500.0,25.0,125.0,3,29,2016,Y
3,24900,Brekke LTD,350000.0,490000.0,4.0,75.0,10,27,2015,Y
4,651029,Harbor Co,15000.0,12750.0,-15.0,NaN,2,2,2014,N

In [35]:
df.dtypes

Customer Number      int32
Customer Name       object
2016               float64
2017               float64
Percent Growth     float64
Jan Units          float64
Month                int64
Day                  int64
Year                 int64
Active              object
dtype: object

# Q 4
- The Active column should be a boolean - How will you convert

In [38]:
df["Active"]= np.where(df["Active"]=="Y", True , False)

In [39]:
df

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Month,Day,Year,Active
0,10002,Quest Industries,125000.0,162500.0,30.0,500.0,1,10,2015,True
1,552278,Smith Plumbing,920000.0,1012000.0,10.0,700.0,6,15,2014,True
2,23477,ACME Industrial,50000.0,62500.0,25.0,125.0,3,29,2016,True
3,24900,Brekke LTD,350000.0,490000.0,4.0,75.0,10,27,2015,True
4,651029,Harbor Co,15000.0,12750.0,-15.0,NaN,2,2,2014,False

In [40]:
df.dtypes

Customer Number      int32
Customer Name       object
2016               float64
2017               float64
Percent Growth     float64
Jan Units          float64
Month                int64
Day                  int64
Year                 int64
Active                bool
dtype: object

# Q 5
 - We have Month , Day and Year columns that should be converted to datetime64

In [44]:
df["Date"] = pd.to_datetime(df[["Year","Month","Day"]])

In [45]:
df

,Customer Number,Customer Name,2016,2017,Percent Growth,Jan Units,Month,Day,Year,Active,Date
0,10002,Quest Industries,125000.0,162500.0,30.0,500.0,1,10,2015,True,2015-01-10
1,552278,Smith Plumbing,920000.0,1012000.0,10.0,700.0,6,15,2014,True,2014-06-15
2,23477,ACME Industrial,50000.0,62500.0,25.0,125.0,3,29,2016,True,2016-03-29
3,24900,Brekke LTD,350000.0,490000.0,4.0,75.0,10,27,2015,True,2015-10-27
4,651029,Harbor Co,15000.0,12750.0,-15.0,NaN,2,2,2014,False,2014-02-02

In [51]:
df.dtypes

Customer Number             int32
Customer Name              object
2016                      float64
2017                      float64
Percent Growth            float64
Jan Units                 float64
Month                       int64
Day                         int64
Year                        int64
Active                       bool
Date               datetime64[ns]
dtype: object

# Q 6
 -  Date(datatime64) to year , month, day

In [48]:
df["Date"].dt.year

0    2015
1    2014
2    2016
3    2015
4    2014
Name: Date, dtype: int32

In [49]:
df["Date"].dt.month

0     1
1     6
2     3
3    10
4     2
Name: Date, dtype: int32

In [50]:
df["Date"].dt.day

0    10
1    15
2    29
3    27
4     2
Name: Date, dtype: int32

# Q 7
 - Month 1-3 Q1 , 4-6 Q2 ,7-9 Q3 9-12 Q4 - Convert it

In [52]:
def convert_function(num):
    if num >=1 and num<=3:
        return "Q1"
    elif num>=4 and num<=6:
        return "Q2"
    elif num>=7 and num<=9:
        return "Q3"
    else:
        return "Q4"

In [55]:
df["Month"].apply(convert_function)

0    Q1
1    Q2
2    Q1
3    Q4
4    Q1
Name: Month, dtype: object